{
    "logs": [
        {
            "date": "29-03-2025",
            "entries": [
                {
                    "type": "INFO",
                    "time": "13:00",
                    "content": "Создание канала – первый шаг к самовыражению и развитию."
                },
                {
                    "type": "DEBUG", 
                    "time": "13:02",
                    "content": "Почему канал? В первую очередь, это интересный способ самоконтроля и продвижения к цели. Канал должен стать хроникой моего пути."
                },
                {
                    "type": "INFO",
                    "time": "13:04", 
                    "content": "Канал будет посвящён фуллстек-разработке, личным проектам, а может и небольшим моментам из жизни по теме самого канала."
                },
                {
                    "type": "SUCCESS",
                    "time": "13:05",
                    "content": "Публикация первого поста и открытие нового этапа."
                }
            ]
        },
        {
            "date": "21-03-2025",
            "entries": [
                {
                    "type": "INFO",
                    "time": "12:30",
                    "content": "Начало освоения HTML, структуры HTML документа."
                },
                {
                    "type": "DEBUG",
                    "time": "12:30",
                    "content": "Занялся основами структуры страниц. Изучил, как правильно расставлять элементы на странице — от организации контента до определения его логических частей. Это позволяет не просто создавать страницы, а делать их удобными и понятными.\n\n- Начал с основ: понял, как работает разметка, и как она влияет на отображение контента.\n- Прошел этап проектирования простых страниц, научился использовать блоки для разделения информации.\n- Приступил к созданию первой структуры страницы — теперь каждый элемент имеет своё место и смысл.\n\nПока что не так уж и интересно, однако дальше - больше."
                },
                {
                    "type": "SUCCESS", 
                    "time": "14:00",
                    "content": "Завершил первый этап — основа есть. Теперь можно(даже нужно) переходить к следующему."
                }
            ]
        },
        {
            "date": "23-03-2025", 
            "entries": [
                {
                    "type": "INFO",
                    "time": "14:00",
                    "content": "Продвижение в изучении HTML, на этот раз в разметке текста."
                },
                {
                    "type": "DEBUG",
                    "time": "14:00", 
                    "content": "Этот этап оказался более интересным и многообразным. Вот что успел освоить:\n\n- Списки: научился работать с неупорядоченными и упорядоченными списками, а также с атрибутами, которые позволяют их модифицировать, например, start и reversed.\n- Вложенные списки: теперь знаю, как организовать многоуровневые списки для более сложных структур.\n- Список описаний: освоил <dl>, <dt> и <dd> — важные теги для создания описательных списков.\n- Преформатированный текст: освоил тег <pre>, который позволяет сохранять форматирование, как в исходном коде.\n- Символы-мнемоники: научился использовать HTML-сущности для вставки спецсимволов.\n- Тег <code>: теперь понимаю, как вставлять фрагменты кода прямо в текст и комбинировать его с <pre> для лучшего отображения.\n- Цитаты: освоил <q> для встроенных цитат и <blockquote> для выделенных.\n- Перенос строки: научился использовать <br> для перехода на новую строку.\n- Индексы: разобрался с <sub> и <sup> для нижних и верхних индексов.\n- Дата и время: <time> стал моим помощником для корректной разметки времени и дат.\n- Теги акцентов: научился работать с <em> и <i> для акцентирования внимания, а также с <strong> и <b> для выделения важности.\n- Изменения: освоил <del> и <ins>, которые помогают показывать изменения на странице.\n- Контейнеры: научился использовать <div> и <span> для группировки и стилизации элементов."
                },
                {
                    "type": "SUCCESS",
                    "time": "16:00",
                    "content": "Очередной этап завершен. Следующий шаг — много практики для точного закрепления знаний и переход к следующей теме."
                }
            ]
        }
    ]
} 